
% rectangle('Position',[1,2,3,4],'facecolor',[0.1,0.2,0.3])
n=256;
a=[ 46 139 87 ]
rgb=a./n;
rectangle('Position',[1,2,3,4],'facecolor',rgb)

% 
% 黑色 R G B   
% 黑色 0 0 0   
% 象牙黑 41 36 33   
%   
% 灰色 R G B   
% 泠灰 128 138 135   
% 灰色 192 192 192   
% 石板灰 112 128 144   
% 暖灰色 128 128 105   
%   
% 白色 R G B   
% 古董白 250 235 215   
% 天蓝色 240 255 255   
% 桔黄色 255 228 196   
% 白杏仁 255 235 205   
% cornsilk 255 248 220   
% 蛋壳色 252 230 201   
% 花白 255 250 240   
% gainsboro 220 220 220   
% ghost white 248 248 255   
% 蜜露橙 240 255 240   
% 象牙色 255 255 240   
% 亚麻色 250 240 230   
% navajo white 255 222 173   
% old lace 253 245 230   
% 海贝壳色 255 245 238   
% 雪白 255 250 250   
% 淡黄色 245 222 179   
% 白色 255 255 255   
% 白烟 245 245 245   
%   
% 红色 R G B   
% 砖红 156 102 31   
% 镉红 227 23 13   
% 珊瑚色 255 127 80   
% 耐火砖色 178 34 34   
% 印度红 176 23 31   
% 栗色 176 48 96   
% 粉红 255 192 203   
% 木莓色 135 38 87   
% 红 255 0 0   
% 橙红色 250 128 114   
% 蕃茄红 255 99 71   
%   
% 橙色 R G B   
% 镉橙 255 97 3   
% 胡萝卜色 237 145 33   
% 桔黄 255 128 0   
% 桔红 255 69 0   
%   
% 黄色 R G B   
% 香蕉色 227 207 87   
% 镉黄 255 153 18   
% dougello 235 142 85   
% forum gold 255 227 132   
% 金黄色 255 215 0   
% 黄花色 218 165 32   
% 瓜色 227 168 105   
% 黄色 255 255 0   
%   
% 棕色 R G B   
% 米色 163 148 128   
% 棕色 128 42 42   
% 锻浓黄土色 138 54 15   
% 锻棕土色 138 51 36   
% 巧克力色 210 105 30   
% 肉色 255 125 64   
% 黄褐色 240 230 140   
% 玫瑰红 188 143 143   
% 肖贡土色 199 97 20   
% 标土棕 115 74 18   
% 乌贼墨棕 94 38 18   
% 赭色 160 82 45   
% 马 139 69 19   
% 沙棕色 244 164 96   
% 棕褐色 210 180 140   
%   
% 蓝色 R G B   
% 蓝色 0 0 255   
% 钴色 61 89 171   
% dodger blue 30 144 255   
% 靛青 8 46 84   
% jackie blue 11 23 70   
% 锰蓝 3 168 158   
% 深蓝色 25 25 112   
% 藏青色 0 0 128   
% 孔雀篮色 51 161 201   
% 浅灰蓝色 176 224 230   
%   
% 品蓝 65 105 225   
% 石板蓝 106 90 205   
% 天蓝 135 206 235   
% 钢青色 70 130 180   
% 土耳其玉色 0 199 140   
% 深蓝色 18 10 143   
%   
% 青色 R G B   
% 碧绿色 127 255 212   
% 青色 0 255 255   
% 青绿色 64 224 208   
%   
% 绿色 R G B   
% 黄绿色 127 255 0   
% 钴绿色 61 145 64   
% 翠绿色 0 201 87   
% 森林绿 34 139 34   
% 绿色 0 255 0   
% 草地绿 124 252 0   
% 酸橙绿 50 205 50   
% 薄菏色 189 252 201   
% 草绿色 107 142 35   
% 暗绿色 48 128 20   
% 海绿色 46 139 87   
% 嫩绿色 0 255 127   
% 绿土 56 94 15   
%   
% 深红色 R G B   
% 紫罗蓝色 138 43 226   
% jasoa 160 102 211   
% 湖紫色 153 51 250   
% 深红色 255 0 255   
% 淡紫色 218 112 214   
% 梅红色 221 160 221   
% 紫色 160 32 240   
% 紫罗蓝色 143 94 153 
