# -*- coding: utf-8 -*-
"""
Created on Mon Jan 15 12:43:17 2018

@author: ldz
"""
import numpy as np
#==============================================================================
'''删除list元素''' 
#==============================================================================
'''循环删除元素''' 
a = [1,2,3,4,5,6,7]
for i in a:
    if i==3 or i==4:
        a.remove(i)
'''注意陷阱：
删除3之后，4顶替其位置，使之漏删'''       
print(a)  # out : 1 2 4 5 6 7

'''改进'''
b = [1,2,3,4,5,6,7]
c = []
for i in b:
    if i==3 or i==4:
        c.append(i)
print(c) # out : 3 4        
for i in c:
    b.remove(i)
print(b) # out : 1 2 5 6 7

'''效率较高的方法'''
deleK = 3
L = [1, 3, 4, 12, 3, 3, 34, 23, 12, 3]
L = filter(lambda x: x != deleK, L)
L = [i for i in L]
print(L)

# =============================================================================
'''删除array元素''' 
# =============================================================================
a=np.array([1,2,3 ])
a=np.delete(a,np.where(a==1)) #delete(arr, obj, axis=None)
print(a)

'''删除符合要求的列'''
a=np.array([[1,2,2],[2,3,4]])
a=np.delete(a,np.where(a[0,:]==2),axis=1)
print(a)